In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt 

import datetime
from impyute.imputation.cs import mice

In [2]:
london_yearly = pd.read_csv("Datasets/housing_in_london_yearly_variables.csv")
london_yearly["number_of_jobs"] = london_yearly["number_of_jobs"].fillna(0)
london_yearly["life_satisfaction"] = london_yearly["life_satisfaction"].fillna(0)
london_yearly["area_size"] = london_yearly["area_size"].fillna(0)
london_yearly["no_of_houses"] = london_yearly["no_of_houses"].fillna(0)

london_yearly['date'] = pd.to_datetime(london_yearly.date)
london_yearly = pd.DataFrame(london_yearly)
london_yearly.fillna(0)

del london_yearly["code"]
del london_yearly["recycling_pct"]
del london_yearly["borough_flag"]

london_yearly.head()

,area,date,median_salary,life_satisfaction,mean_salary,population_size,number_of_jobs,area_size,no_of_houses
0,city of london,1999-12-01,33020.0,0.0,48922,6581.0,0.0,0.0,0.0
1,barking and dagenham,1999-12-01,21480.0,0.0,23620,162444.0,0.0,0.0,0.0
2,barnet,1999-12-01,19568.0,0.0,23128,313469.0,0.0,0.0,0.0
3,bexley,1999-12-01,18621.0,0.0,21386,217458.0,0.0,0.0,0.0
4,brent,1999-12-01,18532.0,0.0,20911,260317.0,0.0,0.0,0.0

In [3]:
london_yearly.date.unique()

array(['1999-12-01T00:00:00.000000000', '2000-12-01T00:00:00.000000000',
       '2001-12-01T00:00:00.000000000', '2002-12-01T00:00:00.000000000',
       '2003-12-01T00:00:00.000000000', '2004-12-01T00:00:00.000000000',
       '2005-12-01T00:00:00.000000000', '2006-12-01T00:00:00.000000000',
       '2007-12-01T00:00:00.000000000', '2008-12-01T00:00:00.000000000',
       '2009-12-01T00:00:00.000000000', '2010-12-01T00:00:00.000000000',
       '2011-12-01T00:00:00.000000000', '2012-12-01T00:00:00.000000000',
       '2013-12-01T00:00:00.000000000', '2014-12-01T00:00:00.000000000',
       '2015-12-01T00:00:00.000000000', '2016-12-01T00:00:00.000000000',
       '2017-12-01T00:00:00.000000000', '2018-12-01T00:00:00.000000000',
       '2019-12-01T00:00:00.000000000'], dtype='datetime64[ns]')

In [4]:
london_yearly.life_satisfaction.unique()

array([0.  , 7.05, 7.43, 7.42, 7.11, 7.5 , 7.25, 7.04, 7.22, 7.23, 7.18,
       7.  , 7.38, 7.31, 7.35, 7.4 , 7.26, 7.09, 7.57, 7.33, 7.13, 7.14,
       7.12, 7.52, 7.36, 7.39, 7.02, 7.46, 7.44, 7.37, 7.47, 7.28, 7.51,
       7.53, 7.41, 7.6 , 7.24, 7.01, 7.15, 7.07, 7.21, 7.17, 7.7 , 7.08,
       7.3 , 7.32, 7.54, 7.55, 7.67, 7.34, 7.58, 7.49, 7.56, 7.73, 7.71,
       7.45, 7.62, 7.63, 7.65, 7.64, 7.66, 7.89, 7.68, 7.69, 7.29, 7.78,
       7.87, 7.74, 7.48, 7.85, 7.96, 7.61, 7.75, 7.59, 7.76, 7.88, 7.79,
       7.91, 7.72, 7.92, 7.84, 7.82, 7.77])

In [5]:
london_yearly.dtypes

area                         object
date                 datetime64[ns]
median_salary               float64
life_satisfaction           float64
mean_salary                  object
population_size             float64
number_of_jobs              float64
area_size                   float64
no_of_houses                float64
dtype: object

In [8]:
london_yearly.area.unique()

array(['city of london', 'barking and dagenham', 'barnet', 'bexley',
       'brent', 'bromley', 'camden', 'croydon', 'ealing', 'enfield',
       'greenwich', 'hackney', 'hammersmith and fulham', 'haringey',
       'harrow', 'havering', 'hillingdon', 'hounslow', 'islington',
       'kensington and chelsea', 'kingston upon thames', 'lambeth',
       'lewisham', 'merton', 'newham', 'redbridge',
       'richmond upon thames', 'southwark', 'sutton', 'tower hamlets',
       'waltham forest', 'wandsworth', 'westminster', 'north east',
       'north west', 'yorkshire and the humber', 'east midlands',
       'west midlands', 'east', 'london', 'south east', 'south west',
       'inner london', 'outer london', 'england', 'united kingdom',
       'great britain', 'england and wales', 'northern ireland',
       'scotland', 'wales'], dtype=object)

In [9]:
london_yearly.nunique()

area                   51
date                   21
median_salary        1017
life_satisfaction      83
mean_salary          1041
population_size      1017
number_of_jobs        505
area_size              38
no_of_houses          664
dtype: int64

In [23]:
leave_values = ["inner london", "outer london", "NaN"] #leave out these areas because of overlap and too many NaN values
london_yearly=london_yearly.applymap(lambda x: np.nan if x in leave_values else x)

In [17]:
london_yearly_median = pd.DataFrame(london_yearly, columns=["date", "area", "median_salary"])
london_yearly_median.head()

        date                  area  median_salary
0 1999-12-01        city of london        33020.0
1 1999-12-01  barking and dagenham        21480.0
2 1999-12-01                barnet        19568.0
3 1999-12-01                bexley        18621.0
4 1999-12-01                 brent        18532.0

In [18]:
#Using MICE method
X = london_yearly_median["median_salary"]


# imputed = mice(X)
# london_yearly_median = imputed[:, :]

In [24]:
#Comparing line graphs first
#Compare mean salaries over the years

london_yearly_salary = london_yearly.pivot(index = 'area', columns = 'date', values = 'median_salary')
london_yearly_salary

ValueError: Index contains duplicate entries, cannot reshape

In [ ]:
#Machine learning fill NaN values